<!-- html部分 -->
<template>
	<div id="app">
		<h1>企业能耗对比图</h1>
		 <ve-line :data="chartData"></ve-line>
		 <h1>企业作业量对比图（单元：万吨）</h1>
		 <ve-histogram :data="chartData2"></ve-histogram>
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		name:'',
		data() {
			return {
				chartData: {
				  columns: ['月份', '周口港', '开封港', '漯河港'],
				  rows: [
					{ '月份': '1月', '周口港': 13, '开封港': 10, '漯河港': 32 },
					{ '月份': '2月', '周口港': 35, '开封港': 32, '漯河港': 26 },
					{ '月份': '3月', '周口港': 29, '开封港': 23, '漯河港': 56 },
					{ '月份': '4月', '周口港': 17, '开封港': 23, '漯河港': 49 },
					{ '月份': '5月', '周口港': 37, '开封港': 52, '漯河港': 23 },
					{ '月份': '6月', '周口港': 45, '开封港': 33, '漯河港': 38 },
					{ '月份': '7月', '周口港': 45, '开封港': 23, '漯河港': 38 },
					{ '月份': '8月', '周口港': 40, '开封港': 13, '漯河港': 36 }
				  ]
				  
				},
				chartData2: {
				  columns: ['月份', '周口港', '开封港', '漯河港'],
				  rows: [
					{ '月份': '1月', '周口港': 13, '开封港': 10, '漯河港': 32 },
					{ '月份': '2月', '周口港': 35, '开封港': 32, '漯河港': 26 },
					{ '月份': '3月', '周口港': 29, '开封港': 26, '漯河港': 16 },
					{ '月份': '4月', '周口港': 17, '开封港': 14, '漯河港': 39 },
					{ '月份': '5月', '周口港': 37, '开封港': 34, '漯河港': 23 },
					{ '月份': '6月', '周口港': 45, '开封港': 25, '漯河港': 55 },
					{ '月份': '7月', '周口港': 25, '开封港': 32, '漯河港': 48 },
					{ '月份': '8月', '周口港': 35, '开封港': 35, '漯河港': 38 },

				  ]
				}
			};
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>

</style>
